app/controllers/raichands_controller.rb

SELECT "raichands".* FROM "raichands"
---
  def index
    @raichands = Raichand.all

SELECT "raichands".* FROM "raichands" WHERE "raichands"."id" = 1 LIMIT 1
---
  def show
    @raichand = Raichand.find(params[:id])

SELECT "raichands".* FROM "raichands" WHERE "raichands"."id" = 2 LIMIT 1
---
  def edit
    @raichand = Raichand.find(params[:id])

INSERT INTO "raichands" ("updated_at", "email", "created_at", "name") VALUES ('2011-11-28 16:33:11.046349', 'abhidgr8@gmail.com', '2011-11-28 16:33:11.046349', 'Abhishek')
---
  def create
    @raichand = Raichand.new(params[:raichand])

    respond_to do |format|
      if @raichand.save

SELECT "raichands".* FROM "raichands" WHERE "raichands"."id" = 2 LIMIT 1
UPDATE "raichands" SET "email" = 'sheetu.g@gmail.com', "updated_at" = '2011-11-28 16:36:01.711275' WHERE "raichands"."id" = 2
---
  def update
    @raichand = Raichand.find(params[:id])

    respond_to do |format|
      if @raichand.update_attributes(params[:raichand])